examples/EmberPaperCases/FenceHeight/36ft/bb_YesFenceYesHouse_16H/a_windSim/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue Cd 0
    volScalarFieldValue LAD 0
);

regions
(
	boxToCell
    {
        // this represents an H x 8H x H vegetation fence to be placed 10H downwind in x with 10H on each side in y
        // the vegetation fence consisting of 8 full grown oak trees of size L x W x H, with L == W == H and H = 36 ft
        // so the vegetation fence is 36 ft x 288 ft x 36 ft (10.9728 m x 87.7824 m x 10.9728 m), 
        // placed 10H = 10*36 ft = 360 ft (109.7280 m) to 10H + 1H = 11H = 11*36 ft = 396 ft (120.7008 m) in x,
        // placed 10H = 10*36 ft = 360 ft (109.7280 m) to 10H + 8H (288 ft) = 18H = 18*36 ft = 648 ft (197.5104 m) in y
        // placed 0H = 0 ft (0 m) to 1H = 36 ft (10.9728 m) in z
        // make sure to do at least 4 decimal places in calculations from ft to m to reduce round off error when being used with the mesh resolution
        box ( 109.7280 109.7280 0.0000) ( 120.7008 197.5104 10.9728);
        fieldValues
        (
            volScalarFieldValue  Cd 0.5
            volScalarFieldValue LAD 10
        );
    }
);


// ************************************************************************* //
